; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l34_p34_c34_g34_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	loc30 - location
	loc31 - location
	loc32 - location
	loc33 - location
	loc34 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	crate29 - crate
	crate30 - crate
	crate31 - crate
	crate32 - crate
	crate33 - crate
	crate34 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
	person31 - person
	person32 - person
	person33 - person
	person34 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(at crate10 depot)
	(at crate11 depot)
	(at crate12 depot)
	(at crate13 depot)
	(at crate14 depot)
	(at crate15 depot)
	(at crate16 depot)
	(at crate17 depot)
	(at crate18 depot)
	(at crate19 depot)
	(at crate20 depot)
	(at crate21 depot)
	(at crate22 depot)
	(at crate23 depot)
	(at crate24 depot)
	(at crate25 depot)
	(at crate26 depot)
	(at crate27 depot)
	(at crate28 depot)
	(at crate29 depot)
	(at crate30 depot)
	(at crate31 depot)
	(at crate32 depot)
	(at crate33 depot)
	(at crate34 depot)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 food)
	(crate-content crate4 food)
	(crate-content crate5 food)
	(crate-content crate6 food)
	(crate-content crate7 food)
	(crate-content crate8 food)
	(crate-content crate9 food)
	(crate-content crate10 food)
	(crate-content crate11 food)
	(crate-content crate12 food)
	(crate-content crate13 food)
	(crate-content crate14 food)
	(crate-content crate15 food)
	(crate-content crate16 food)
	(crate-content crate17 food)
	(crate-content crate18 food)
	(crate-content crate19 food)
	(crate-content crate20 food)
	(crate-content crate21 food)
	(crate-content crate22 food)
	(crate-content crate23 food)
	(crate-content crate24 food)
	(crate-content crate25 food)
	(crate-content crate26 food)
	(crate-content crate27 food)
	(crate-content crate28 food)
	(crate-content crate29 medicine)
	(crate-content crate30 medicine)
	(crate-content crate31 medicine)
	(crate-content crate32 medicine)
	(crate-content crate33 medicine)
	(crate-content crate34 medicine)
	(at person1 loc30)
	(at person2 loc7)
	(at person3 loc23)
	(at person4 loc10)
	(at person5 loc31)
	(at person6 loc7)
	(at person7 loc15)
	(at person8 loc14)
	(at person9 loc31)
	(at person10 loc22)
	(at person11 loc1)
	(at person12 loc16)
	(at person13 loc1)
	(at person14 loc3)
	(at person15 loc12)
	(at person16 loc11)
	(at person17 loc2)
	(at person18 loc22)
	(at person19 loc30)
	(at person20 loc1)
	(at person21 loc1)
	(at person22 loc17)
	(at person23 loc6)
	(at person24 loc34)
	(at person25 loc5)
	(at person26 loc34)
	(at person27 loc26)
	(at person28 loc15)
	(at person29 loc26)
	(at person30 loc13)
	(at person31 loc6)
	(at person32 loc9)
	(at person33 loc32)
	(at person34 loc2)
	(person-needs person2 food)
	(person-needs person3 food)
	(person-needs person4 food)
	(person-needs person6 food)
	(person-needs person6 medicine)
	(person-needs person7 food)
	(person-needs person8 food)
	(person-needs person9 food)
	(person-needs person10 food)
	(person-needs person10 medicine)
	(person-needs person13 food)
	(person-needs person13 medicine)
	(person-needs person14 food)
	(person-needs person15 food)
	(person-needs person16 food)
	(person-needs person17 food)
	(person-needs person17 medicine)
	(person-needs person18 food)
	(person-needs person19 food)
	(person-needs person20 food)
	(person-needs person22 food)
	(person-needs person23 food)
	(person-needs person24 food)
	(person-needs person24 medicine)
	(person-needs person26 food)
	(person-needs person27 food)
	(person-needs person28 food)
	(person-needs person29 food)
	(person-needs person30 food)
	(person-needs person31 food)
	(person-needs person31 medicine)
	(person-needs person32 food)
	(person-needs person33 food)
	(person-needs person34 food)
)
(:goal (and
	(at drone1 depot)
	(person-has person2 food)
	(person-has person3 food)
	(person-has person4 food)
	(person-has person6 food)
	(person-has person6 medicine)
	(person-has person7 food)
	(person-has person8 food)
	(person-has person9 food)
	(person-has person10 food)
	(person-has person10 medicine)
	(person-has person13 food)
	(person-has person13 medicine)
	(person-has person14 food)
	(person-has person15 food)
	(person-has person16 food)
	(person-has person17 food)
	(person-has person17 medicine)
	(person-has person18 food)
	(person-has person19 food)
	(person-has person20 food)
	(person-has person22 food)
	(person-has person23 food)
	(person-has person24 food)
	(person-has person24 medicine)
	(person-has person26 food)
	(person-has person27 food)
	(person-has person28 food)
	(person-has person29 food)
	(person-has person30 food)
	(person-has person31 food)
	(person-has person31 medicine)
	(person-has person32 food)
	(person-has person33 food)
	(person-has person34 food)
	))
)

; plan
1. (grab-arm2 drone1 crate34 depot)
   deleted: (arm2-free drone1) (at crate34 depot)
   added: (arm2-load drone1 crate34)
   goals met: 1 of 35
2. (grab-arm1 drone1 crate28 depot)
   deleted: (arm1-free drone1) (at crate28 depot)
   added: (arm1-load drone1 crate28)
   goals met: 1 of 35
3. (move-drone drone1 depot loc23)
   deleted: (at drone1 depot)
   added: (at drone1 loc23)
   goals met: 0 of 35
4. (deliver-arm1 drone1 person3 crate28 food loc23)
   deleted: (arm1-load drone1 crate28) (person-needs person3 food)
   added: (arm1-free drone1) (person-has person3 food)
   goals met: 1 of 35
5. (move-drone drone1 loc23 loc10)
   deleted: (at drone1 loc23)
   added: (at drone1 loc10)
   goals met: 1 of 35
6. (move-drone drone1 loc10 depot)
   deleted: (at drone1 loc10)
   added: (at drone1 depot)
   goals met: 2 of 35
7. (grab-arm1 drone1 crate27 depot)
   deleted: (arm1-free drone1) (at crate27 depot)
   added: (arm1-load drone1 crate27)
   goals met: 2 of 35
8. (move-drone drone1 depot loc10)
   deleted: (at drone1 depot)
   added: (at drone1 loc10)
   goals met: 1 of 35
9. (deliver-arm1 drone1 person4 crate27 food loc10)
   deleted: (arm1-load drone1 crate27) (person-needs person4 food)
   added: (arm1-free drone1) (person-has person4 food)
   goals met: 2 of 35
10. (move-drone drone1 loc10 loc7)
   deleted: (at drone1 loc10)
   added: (at drone1 loc7)
   goals met: 2 of 35
11. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 3 of 35
12. (grab-arm1 drone1 crate26 depot)
   deleted: (arm1-free drone1) (at crate26 depot)
   added: (arm1-load drone1 crate26)
   goals met: 3 of 35
13. (move-drone drone1 depot loc14)
   deleted: (at drone1 depot)
   added: (at drone1 loc14)
   goals met: 2 of 35
14. (deliver-arm1 drone1 person8 crate26 food loc14)
   deleted: (arm1-load drone1 crate26) (person-needs person8 food)
   added: (arm1-free drone1) (person-has person8 food)
   goals met: 3 of 35
15. (move-drone drone1 loc14 loc7)
   deleted: (at drone1 loc14)
   added: (at drone1 loc7)
   goals met: 3 of 35
16. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 4 of 35
17. (grab-arm1 drone1 crate25 depot)
   deleted: (arm1-free drone1) (at crate25 depot)
   added: (arm1-load drone1 crate25)
   goals met: 4 of 35
18. (move-drone drone1 depot loc31)
   deleted: (at drone1 depot)
   added: (at drone1 loc31)
   goals met: 3 of 35
19. (deliver-arm1 drone1 person9 crate25 food loc31)
   deleted: (arm1-load drone1 crate25) (person-needs person9 food)
   added: (arm1-free drone1) (person-has person9 food)
   goals met: 4 of 35
20. (move-drone drone1 loc31 loc7)
   deleted: (at drone1 loc31)
   added: (at drone1 loc7)
   goals met: 4 of 35
21. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 5 of 35
22. (grab-arm1 drone1 crate24 depot)
   deleted: (arm1-free drone1) (at crate24 depot)
   added: (arm1-load drone1 crate24)
   goals met: 5 of 35
23. (move-drone drone1 depot loc3)
   deleted: (at drone1 depot)
   added: (at drone1 loc3)
   goals met: 4 of 35
24. (deliver-arm1 drone1 person14 crate24 food loc3)
   deleted: (arm1-load drone1 crate24) (person-needs person14 food)
   added: (arm1-free drone1) (person-has person14 food)
   goals met: 5 of 35
25. (move-drone drone1 loc3 loc7)
   deleted: (at drone1 loc3)
   added: (at drone1 loc7)
   goals met: 5 of 35
26. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 6 of 35
27. (grab-arm1 drone1 crate23 depot)
   deleted: (arm1-free drone1) (at crate23 depot)
   added: (arm1-load drone1 crate23)
   goals met: 6 of 35
28. (move-drone drone1 depot loc12)
   deleted: (at drone1 depot)
   added: (at drone1 loc12)
   goals met: 5 of 35
29. (deliver-arm1 drone1 person15 crate23 food loc12)
   deleted: (arm1-load drone1 crate23) (person-needs person15 food)
   added: (arm1-free drone1) (person-has person15 food)
   goals met: 6 of 35
30. (move-drone drone1 loc12 loc7)
   deleted: (at drone1 loc12)
   added: (at drone1 loc7)
   goals met: 6 of 35
31. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 7 of 35
32. (grab-arm1 drone1 crate22 depot)
   deleted: (arm1-free drone1) (at crate22 depot)
   added: (arm1-load drone1 crate22)
   goals met: 7 of 35
33. (move-drone drone1 depot loc11)
   deleted: (at drone1 depot)
   added: (at drone1 loc11)
   goals met: 6 of 35
34. (deliver-arm1 drone1 person16 crate22 food loc11)
   deleted: (arm1-load drone1 crate22) (person-needs person16 food)
   added: (arm1-free drone1) (person-has person16 food)
   goals met: 7 of 35
35. (move-drone drone1 loc11 loc7)
   deleted: (at drone1 loc11)
   added: (at drone1 loc7)
   goals met: 7 of 35
36. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 8 of 35
37. (grab-arm1 drone1 crate21 depot)
   deleted: (arm1-free drone1) (at crate21 depot)
   added: (arm1-load drone1 crate21)
   goals met: 8 of 35
38. (move-drone drone1 depot loc30)
   deleted: (at drone1 depot)
   added: (at drone1 loc30)
   goals met: 7 of 35
39. (deliver-arm1 drone1 person19 crate21 food loc30)
   deleted: (arm1-load drone1 crate21) (person-needs person19 food)
   added: (arm1-free drone1) (person-has person19 food)
   goals met: 8 of 35
40. (move-drone drone1 loc30 loc7)
   deleted: (at drone1 loc30)
   added: (at drone1 loc7)
   goals met: 8 of 35
41. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 9 of 35
42. (grab-arm1 drone1 crate20 depot)
   deleted: (arm1-free drone1) (at crate20 depot)
   added: (arm1-load drone1 crate20)
   goals met: 9 of 35
43. (move-drone drone1 depot loc17)
   deleted: (at drone1 depot)
   added: (at drone1 loc17)
   goals met: 8 of 35
44. (deliver-arm1 drone1 person22 crate20 food loc17)
   deleted: (arm1-load drone1 crate20) (person-needs person22 food)
   added: (arm1-free drone1) (person-has person22 food)
   goals met: 9 of 35
45. (move-drone drone1 loc17 loc7)
   deleted: (at drone1 loc17)
   added: (at drone1 loc7)
   goals met: 9 of 35
46. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 10 of 35
47. (grab-arm1 drone1 crate19 depot)
   deleted: (arm1-free drone1) (at crate19 depot)
   added: (arm1-load drone1 crate19)
   goals met: 10 of 35
48. (move-drone drone1 depot loc13)
   deleted: (at drone1 depot)
   added: (at drone1 loc13)
   goals met: 9 of 35
49. (deliver-arm1 drone1 person30 crate19 food loc13)
   deleted: (arm1-load drone1 crate19) (person-needs person30 food)
   added: (arm1-free drone1) (person-has person30 food)
   goals met: 10 of 35
50. (move-drone drone1 loc13 loc7)
   deleted: (at drone1 loc13)
   added: (at drone1 loc7)
   goals met: 10 of 35
51. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 11 of 35
52. (grab-arm1 drone1 crate18 depot)
   deleted: (arm1-free drone1) (at crate18 depot)
   added: (arm1-load drone1 crate18)
   goals met: 11 of 35
53. (move-drone drone1 depot loc9)
   deleted: (at drone1 depot)
   added: (at drone1 loc9)
   goals met: 10 of 35
54. (deliver-arm1 drone1 person32 crate18 food loc9)
   deleted: (arm1-load drone1 crate18) (person-needs person32 food)
   added: (arm1-free drone1) (person-has person32 food)
   goals met: 11 of 35
55. (move-drone drone1 loc9 loc7)
   deleted: (at drone1 loc9)
   added: (at drone1 loc7)
   goals met: 11 of 35
56. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 12 of 35
57. (grab-arm1 drone1 crate17 depot)
   deleted: (arm1-free drone1) (at crate17 depot)
   added: (arm1-load drone1 crate17)
   goals met: 12 of 35
58. (move-drone drone1 depot loc32)
   deleted: (at drone1 depot)
   added: (at drone1 loc32)
   goals met: 11 of 35
59. (deliver-arm1 drone1 person33 crate17 food loc32)
   deleted: (arm1-load drone1 crate17) (person-needs person33 food)
   added: (arm1-free drone1) (person-has person33 food)
   goals met: 12 of 35
60. (move-drone drone1 loc32 loc7)
   deleted: (at drone1 loc32)
   added: (at drone1 loc7)
   goals met: 12 of 35
61. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 13 of 35
62. (grab-arm1 drone1 crate16 depot)
   deleted: (arm1-free drone1) (at crate16 depot)
   added: (arm1-load drone1 crate16)
   goals met: 13 of 35
63. (move-drone drone1 depot loc7)
   deleted: (at drone1 depot)
   added: (at drone1 loc7)
   goals met: 12 of 35
64. (deliver-arm1 drone1 person2 crate16 food loc7)
   deleted: (arm1-load drone1 crate16) (person-needs person2 food)
   added: (arm1-free drone1) (person-has person2 food)
   goals met: 13 of 35
65. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 14 of 35
66. (grab-arm1 drone1 crate15 depot)
   deleted: (arm1-free drone1) (at crate15 depot)
   added: (arm1-load drone1 crate15)
   goals met: 14 of 35
67. (move-drone drone1 depot loc7)
   deleted: (at drone1 depot)
   added: (at drone1 loc7)
   goals met: 13 of 35
68. (deliver-arm1 drone1 person6 crate15 food loc7)
   deleted: (arm1-load drone1 crate15) (person-needs person6 food)
   added: (arm1-free drone1) (person-has person6 food)
   goals met: 14 of 35
69. (deliver-arm2 drone1 person6 crate34 medicine loc7)
   deleted: (arm2-load drone1 crate34) (person-needs person6 medicine)
   added: (arm2-free drone1) (person-has person6 medicine)
   goals met: 15 of 35
70. (move-drone drone1 loc7 loc22)
   deleted: (at drone1 loc7)
   added: (at drone1 loc22)
   goals met: 15 of 35
71. (move-drone drone1 loc22 depot)
   deleted: (at drone1 loc22)
   added: (at drone1 depot)
   goals met: 16 of 35
72. (grab-arm2 drone1 crate33 depot)
   deleted: (arm2-free drone1) (at crate33 depot)
   added: (arm2-load drone1 crate33)
   goals met: 16 of 35
73. (grab-arm1 drone1 crate14 depot)
   deleted: (arm1-free drone1) (at crate14 depot)
   added: (arm1-load drone1 crate14)
   goals met: 16 of 35
74. (move-drone drone1 depot loc22)
   deleted: (at drone1 depot)
   added: (at drone1 loc22)
   goals met: 15 of 35
75. (deliver-arm1 drone1 person10 crate14 food loc22)
   deleted: (arm1-load drone1 crate14) (person-needs person10 food)
   added: (arm1-free drone1) (person-has person10 food)
   goals met: 16 of 35
76. (move-drone drone1 loc22 depot)
   deleted: (at drone1 loc22)
   added: (at drone1 depot)
   goals met: 17 of 35
77. (grab-arm1 drone1 crate13 depot)
   deleted: (arm1-free drone1) (at crate13 depot)
   added: (arm1-load drone1 crate13)
   goals met: 17 of 35
78. (move-drone drone1 depot loc22)
   deleted: (at drone1 depot)
   added: (at drone1 loc22)
   goals met: 16 of 35
79. (deliver-arm2 drone1 person10 crate33 medicine loc22)
   deleted: (arm2-load drone1 crate33) (person-needs person10 medicine)
   added: (arm2-free drone1) (person-has person10 medicine)
   goals met: 17 of 35
80. (move-drone drone1 loc22 depot)
   deleted: (at drone1 loc22)
   added: (at drone1 depot)
   goals met: 18 of 35
81. (grab-arm2 drone1 crate32 depot)
   deleted: (arm2-free drone1) (at crate32 depot)
   added: (arm2-load drone1 crate32)
   goals met: 18 of 35
82. (move-drone drone1 depot loc22)
   deleted: (at drone1 depot)
   added: (at drone1 loc22)
   goals met: 17 of 35
83. (deliver-arm1 drone1 person18 crate13 food loc22)
   deleted: (arm1-load drone1 crate13) (person-needs person18 food)
   added: (arm1-free drone1) (person-has person18 food)
   goals met: 18 of 35
84. (move-drone drone1 loc22 loc1)
   deleted: (at drone1 loc22)
   added: (at drone1 loc1)
   goals met: 18 of 35
85. (move-drone drone1 loc1 depot)
   deleted: (at drone1 loc1)
   added: (at drone1 depot)
   goals met: 19 of 35
86. (grab-arm1 drone1 crate12 depot)
   deleted: (arm1-free drone1) (at crate12 depot)
   added: (arm1-load drone1 crate12)
   goals met: 19 of 35
87. (move-drone drone1 depot loc1)
   deleted: (at drone1 depot)
   added: (at drone1 loc1)
   goals met: 18 of 35
88. (deliver-arm1 drone1 person13 crate12 food loc1)
   deleted: (arm1-load drone1 crate12) (person-needs person13 food)
   added: (arm1-free drone1) (person-has person13 food)
   goals met: 19 of 35
89. (move-drone drone1 loc1 depot)
   deleted: (at drone1 loc1)
   added: (at drone1 depot)
   goals met: 20 of 35
90. (grab-arm1 drone1 crate11 depot)
   deleted: (arm1-free drone1) (at crate11 depot)
   added: (arm1-load drone1 crate11)
   goals met: 20 of 35
91. (move-drone drone1 depot loc1)
   deleted: (at drone1 depot)
   added: (at drone1 loc1)
   goals met: 19 of 35
92. (deliver-arm2 drone1 person13 crate32 medicine loc1)
   deleted: (arm2-load drone1 crate32) (person-needs person13 medicine)
   added: (arm2-free drone1) (person-has person13 medicine)
   goals met: 20 of 35
93. (move-drone drone1 loc1 depot)
   deleted: (at drone1 loc1)
   added: (at drone1 depot)
   goals met: 21 of 35
94. (grab-arm2 drone1 crate31 depot)
   deleted: (arm2-free drone1) (at crate31 depot)
   added: (arm2-load drone1 crate31)
   goals met: 21 of 35
95. (move-drone drone1 depot loc1)
   deleted: (at drone1 depot)
   added: (at drone1 loc1)
   goals met: 20 of 35
96. (deliver-arm1 drone1 person20 crate11 food loc1)
   deleted: (arm1-load drone1 crate11) (person-needs person20 food)
   added: (arm1-free drone1) (person-has person20 food)
   goals met: 21 of 35
97. (move-drone drone1 loc1 loc34)
   deleted: (at drone1 loc1)
   added: (at drone1 loc34)
   goals met: 21 of 35
98. (move-drone drone1 loc34 depot)
   deleted: (at drone1 loc34)
   added: (at drone1 depot)
   goals met: 22 of 35
99. (grab-arm1 drone1 crate10 depot)
   deleted: (arm1-free drone1) (at crate10 depot)
   added: (arm1-load drone1 crate10)
   goals met: 22 of 35
100. (move-drone drone1 depot loc34)
   deleted: (at drone1 depot)
   added: (at drone1 loc34)
   goals met: 21 of 35
101. (deliver-arm1 drone1 person24 crate10 food loc34)
   deleted: (arm1-load drone1 crate10) (person-needs person24 food)
   added: (arm1-free drone1) (person-has person24 food)
   goals met: 22 of 35
102. (move-drone drone1 loc34 depot)
   deleted: (at drone1 loc34)
   added: (at drone1 depot)
   goals met: 23 of 35
103. (grab-arm1 drone1 crate9 depot)
   deleted: (arm1-free drone1) (at crate9 depot)
   added: (arm1-load drone1 crate9)
   goals met: 23 of 35
104. (move-drone drone1 depot loc34)
   deleted: (at drone1 depot)
   added: (at drone1 loc34)
   goals met: 22 of 35
105. (deliver-arm2 drone1 person24 crate31 medicine loc34)
   deleted: (arm2-load drone1 crate31) (person-needs person24 medicine)
   added: (arm2-free drone1) (person-has person24 medicine)
   goals met: 23 of 35
106. (move-drone drone1 loc34 depot)
   deleted: (at drone1 loc34)
   added: (at drone1 depot)
   goals met: 24 of 35
107. (grab-arm2 drone1 crate30 depot)
   deleted: (arm2-free drone1) (at crate30 depot)
   added: (arm2-load drone1 crate30)
   goals met: 24 of 35
108. (move-drone drone1 depot loc34)
   deleted: (at drone1 depot)
   added: (at drone1 loc34)
   goals met: 23 of 35
109. (deliver-arm1 drone1 person26 crate9 food loc34)
   deleted: (arm1-load drone1 crate9) (person-needs person26 food)
   added: (arm1-free drone1) (person-has person26 food)
   goals met: 24 of 35
110. (move-drone drone1 loc34 loc15)
   deleted: (at drone1 loc34)
   added: (at drone1 loc15)
   goals met: 24 of 35
111. (move-drone drone1 loc15 depot)
   deleted: (at drone1 loc15)
   added: (at drone1 depot)
   goals met: 25 of 35
112. (grab-arm1 drone1 crate8 depot)
   deleted: (arm1-free drone1) (at crate8 depot)
   added: (arm1-load drone1 crate8)
   goals met: 25 of 35
113. (move-drone drone1 depot loc15)
   deleted: (at drone1 depot)
   added: (at drone1 loc15)
   goals met: 24 of 35
114. (deliver-arm1 drone1 person7 crate8 food loc15)
   deleted: (arm1-load drone1 crate8) (person-needs person7 food)
   added: (arm1-free drone1) (person-has person7 food)
   goals met: 25 of 35
115. (move-drone drone1 loc15 depot)
   deleted: (at drone1 loc15)
   added: (at drone1 depot)
   goals met: 26 of 35
116. (grab-arm1 drone1 crate7 depot)
   deleted: (arm1-free drone1) (at crate7 depot)
   added: (arm1-load drone1 crate7)
   goals met: 26 of 35
117. (move-drone drone1 depot loc15)
   deleted: (at drone1 depot)
   added: (at drone1 loc15)
   goals met: 25 of 35
118. (deliver-arm1 drone1 person28 crate7 food loc15)
   deleted: (arm1-load drone1 crate7) (person-needs person28 food)
   added: (arm1-free drone1) (person-has person28 food)
   goals met: 26 of 35
119. (move-drone drone1 loc15 loc26)
   deleted: (at drone1 loc15)
   added: (at drone1 loc26)
   goals met: 26 of 35
120. (move-drone drone1 loc26 depot)
   deleted: (at drone1 loc26)
   added: (at drone1 depot)
   goals met: 27 of 35
121. (grab-arm1 drone1 crate6 depot)
   deleted: (arm1-free drone1) (at crate6 depot)
   added: (arm1-load drone1 crate6)
   goals met: 27 of 35
122. (move-drone drone1 depot loc26)
   deleted: (at drone1 depot)
   added: (at drone1 loc26)
   goals met: 26 of 35
123. (deliver-arm1 drone1 person27 crate6 food loc26)
   deleted: (arm1-load drone1 crate6) (person-needs person27 food)
   added: (arm1-free drone1) (person-has person27 food)
   goals met: 27 of 35
124. (move-drone drone1 loc26 depot)
   deleted: (at drone1 loc26)
   added: (at drone1 depot)
   goals met: 28 of 35
125. (grab-arm1 drone1 crate5 depot)
   deleted: (arm1-free drone1) (at crate5 depot)
   added: (arm1-load drone1 crate5)
   goals met: 28 of 35
126. (move-drone drone1 depot loc26)
   deleted: (at drone1 depot)
   added: (at drone1 loc26)
   goals met: 27 of 35
127. (deliver-arm1 drone1 person29 crate5 food loc26)
   deleted: (arm1-load drone1 crate5) (person-needs person29 food)
   added: (arm1-free drone1) (person-has person29 food)
   goals met: 28 of 35
128. (move-drone drone1 loc26 loc6)
   deleted: (at drone1 loc26)
   added: (at drone1 loc6)
   goals met: 28 of 35
129. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 29 of 35
130. (grab-arm1 drone1 crate4 depot)
   deleted: (arm1-free drone1) (at crate4 depot)
   added: (arm1-load drone1 crate4)
   goals met: 29 of 35
131. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 28 of 35
132. (deliver-arm1 drone1 person23 crate4 food loc6)
   deleted: (arm1-load drone1 crate4) (person-needs person23 food)
   added: (arm1-free drone1) (person-has person23 food)
   goals met: 29 of 35
133. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 30 of 35
134. (grab-arm1 drone1 crate3 depot)
   deleted: (arm1-free drone1) (at crate3 depot)
   added: (arm1-load drone1 crate3)
   goals met: 30 of 35
135. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 29 of 35
136. (deliver-arm1 drone1 person31 crate3 food loc6)
   deleted: (arm1-load drone1 crate3) (person-needs person31 food)
   added: (arm1-free drone1) (person-has person31 food)
   goals met: 30 of 35
137. (deliver-arm2 drone1 person31 crate30 medicine loc6)
   deleted: (arm2-load drone1 crate30) (person-needs person31 medicine)
   added: (arm2-free drone1) (person-has person31 medicine)
   goals met: 31 of 35
138. (move-drone drone1 loc6 loc2)
   deleted: (at drone1 loc6)
   added: (at drone1 loc2)
   goals met: 31 of 35
139. (move-drone drone1 loc2 depot)
   deleted: (at drone1 loc2)
   added: (at drone1 depot)
   goals met: 32 of 35
140. (grab-arm2 drone1 crate29 depot)
   deleted: (arm2-free drone1) (at crate29 depot)
   added: (arm2-load drone1 crate29)
   goals met: 32 of 35
141. (grab-arm1 drone1 crate2 depot)
   deleted: (arm1-free drone1) (at crate2 depot)
   added: (arm1-load drone1 crate2)
   goals met: 32 of 35
142. (move-drone drone1 depot loc2)
   deleted: (at drone1 depot)
   added: (at drone1 loc2)
   goals met: 31 of 35
143. (deliver-arm2 drone1 person17 crate29 medicine loc2)
   deleted: (arm2-load drone1 crate29) (person-needs person17 medicine)
   added: (arm2-free drone1) (person-has person17 medicine)
   goals met: 32 of 35
144. (deliver-arm1 drone1 person17 crate2 food loc2)
   deleted: (arm1-load drone1 crate2) (person-needs person17 food)
   added: (arm1-free drone1) (person-has person17 food)
   goals met: 33 of 35
145. (move-drone drone1 loc2 depot)
   deleted: (at drone1 loc2)
   added: (at drone1 depot)
   goals met: 34 of 35
146. (grab-arm2 drone1 crate1 depot)
   deleted: (arm2-free drone1) (at crate1 depot)
   added: (arm2-load drone1 crate1)
   goals met: 34 of 35
147. (move-drone drone1 depot loc2)
   deleted: (at drone1 depot)
   added: (at drone1 loc2)
   goals met: 33 of 35
148. (deliver-arm2 drone1 person34 crate1 food loc2)
   deleted: (arm2-load drone1 crate1) (person-needs person34 food)
   added: (arm2-free drone1) (person-has person34 food)
   goals met: 34 of 35
149. (move-drone drone1 loc2 depot)
   deleted: (at drone1 loc2)
   added: (at drone1 depot)
   goals met: 35 of 35
